{
  "plugins": {
    "LuaSnip": {
      "src": "https://github.com/L3MON4D3/LuaSnip.git",
      "version": "2.0.0 - 3.0.0"
    },
    "alpha-nvim": {
      "src": "https://github.com/goolord/alpha-nvim.git"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session.git"
    },
    "blink.cmp": {
      "src": "https://github.com/saghen/blink.cmp.git",
      "version": "1.0.0 - 2.0.0"
    },
    "catppuccin": {
      "src": "https://github.com/catppuccin/nvim"
    },
    "ccc.nvim": {
      "src": "https://github.com/uga-rosa/ccc.nvim.git"
    },
    "codediff.nvim": {
      "src": "https://github.com/esmuellert/codediff.nvim.git"
    },
    "codex.nvim": {
      "src": "https://github.com/johnseth97/codex.nvim.git"
    },
    "conform.nvim": {
      "src": "https://github.com/stevearc/conform.nvim.git"
    },
    "copilot-lsp": {
      "src": "https://github.com/copilotlsp-nvim/copilot-lsp.git"
    },
    "copilot.lua": {
      "src": "https://github.com/zbirenbaum/copilot.lua.git"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets.git"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua.git"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim.git"
    },
    "harpoon": {
      "src": "https://github.com/ThePrimeagen/harpoon.git",
      "version": "'harpoon2'"
    },
    "mason-lspconfig.nvim": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim.git"
    },
    "mason-tool-installer.nvim": {
      "src": "https://github.com/WhoIsSethDaniel/mason-tool-installer.nvim.git"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim.git"
    },
    "mini.nvim": {
      "src": "https://github.com/nvim-mini/mini.nvim.git"
    },
    "neogit": {
      "src": "https://github.com/NeogitOrg/neogit.git"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim.git"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim.git"
    },
    "nvim": {
      "src": "https://github.com/catppuccin/nvim.git"
    },
    "nvim-lint": {
      "src": "https://github.com/mfussenegger/nvim-lint.git"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig.git"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify.git"
    },
    "nvim-scissors": {
      "src": "https://github.com/chrisgrieser/nvim-scissors"
    },
    "nvim-treesitter": {
      "src": "https://github.com/thebeardmixedit/nvim-treesitter.git"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/thebeardmixedit/nvim-treesitter-textobjects.git"
    },
    "nvim-ts-autotag": {
      "src": "https://github.com/windwp/nvim-ts-autotag.git"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons.git"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim.git"
    },
    "render-markdown.nvim": {
      "src": "https://github.com/MeanderingProgrammer/render-markdown.nvim.git"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim.git"
    },
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim.git"
    },
    "vim-tmux-navigator": {
      "src": "https://github.com/christoomey/vim-tmux-navigator.git"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim.git"
    }
  }
}
